# 1) Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# Number = int(input('введите ваше число : '))
# pr = 1

# for i in range(1, Number + 1):
#    if(i <= Number):
#       pr *= i
#       print(pr) 
      
      
 